
INSERT INTO dbo.Этажи([Номер этажа], [Количество мест], [Требуемый план абонимента])
VALUES (1, 6, 'Не нужен'),
	   (2, 6, 'Базовый'),
	   (3, 6, 'Продвинутый');

INSERT INTO dbo.[Парковочные места]([Номер места], [Номер этажа], [Номер клиента], [Занято])
VALUES (1, 1, NULL, 0),
	   (2, 1, 1, 1),
	   (3, 1, NULL, 0),
	   (4, 1, NULL, 0),
	   (5, 1, 9, 1),
	   (6, 1, 5, 1),

	   (7, 2, NULL, 0),
	   (8, 2, 4, 1),
	   (9, 2, NULL, 0),
	   (10, 2, 6, 0),
	   (11, 2, 7, 1),
	   (12, 2, NULL, 0),

	   (13, 3, 10, 1),
	   (14, 3, NULL, 0),
	   (15, 3, 2, 1),
	   (16, 3, 3, 0),
	   (17, 3, NULL, 0),
	   (18, 3, NULL, 0);

INSERT INTO dbo.[Регистр использования парковочных мест]([Номер парковочного места], [Номер клиента], [Начало аренды], [Конец аренды], [Номер купленного абонимента])
VALUES (16, 3, '2021-11-20 13:35:00', '2021-11-21 07:17:00', 1),
	   (11, 7, '2021-11-21 10:02:00', NULL, 2),
	   (4, 8, '2021-11-21 12:12:00', '2021-11-21 19:20:00', NULL),
	   (15, 2, '2021-11-21 12:13:00', NULL, 3),
	   (8, 4, '2021-11-21 13:35:00', NULL, 4),
	   (5, 9, '2021-11-21 13:35:00', NULL, NULL),
	   (13, 10, '2021-11-21 13:37:00', NULL, 5),
	   (2, 1, '2021-11-21 16:01:00', NULL, NULL),
	   (6, 5, '2021-11-21 16:15:00', NULL, NULL),
	   (10, 6, '2021-11-21 17:50:00', NULL, 6);

INSERT INTO dbo.[Клиенты]([Тип машины], [Это постоянный клиент], [Номер абонимента], [Контактный номер])
VALUES ('Легковая', 0, NULL, '+7 (978) 650-70-91'),
	   ('Легковая', 1, 3, '+7 (978) 438-54-55'),
	   ('Легковая', 1, 1, '+7 (978) 630-37-83'),
	   ('Легковая', 0, 4, '+7 (978) 103-91-46'),
	   ('Легковая', 0, NULL, '+7 (978) 409-06-05'),
	   ('Легковая', 1, 6, '+7 (978) 407-34-58'),
	   ('Легковая', 1, 2, '+7 (978) 384-63-73'),
	   ('Легковая', 0, NULL, '+7 (978) 818-49-95'),
	   ('Легковая', 0, NULL, '+7 (978) 700-02-76'),
	   ('Легковая', 1, 5, '+7 (978) 350-84-90');

INSERT INTO dbo.[Абонименты]([Дата активации], [Дата диактивации], [Название плана])
VALUES ('2021-11-20 13:35:00', NULL, 'Продвинутый'),
	   ('2021-11-21 10:02:00', NULL, 'Базовый'),
	   ('2021-11-21 12:13:00', NULL, 'Продвинутый'),
	   ('2021-11-21 13:35:00', NULL, 'Базовый'),
	   ('2021-11-21 13:37:00', NULL, 'Продвинутый'),
	   ('2021-11-21 17:50:00', NULL, 'Базовый');

INSERT INTO dbo.[Планы абониментов]([Название плана], [Стоимость (руб.)], [Длительность (дней)])
VALUES ('Не нужен', 0, 0),
	   ('Базовый', 5000, 30),
	   ('Продвинутый', 10000, 45);
